//
// Created by Donik Goxha on 30-Oct-24.
//
/*
Напишете програма која ќе прочита три цели броја a, b, и c, истите ќе ги подреди по големина
(во растечки редослед), и потоа ќе ја отпечати подредената листа.
Влез
Во првиот ред се наоѓаат броевите a, b и c (0 <= a, b, c <= 500).
Броевите се одделени со еден знак за празно место.
Излез
Излезот се состои од еден ред во кој треба да се наоѓаат броевите a, b и c, подредени во растечки редослед.
 */
#include <iostream>
using namespace std;

int main() {
    int a, b, c;
    cin >> a >> b >> c;
    if (a > b) {
        if (b > c) {
            swap(a, b);
        }
    } else {
        if (b > c) {
            swap(b, c);
        }
    }


    return 0;
}
