//
// Created by Donik Goxha on 30-Oct-24.
//
/*Напишете програма која од стандарден влез (тастатура) ќе прочита три цели броја
A, B и C (кои соодветствуваат на проблемот A#B=C), ќе одреди кој од аритметичките оператори
(+, -, *, /) треба да се постави на местото на # (помеѓу A и B) за да равенката (A#B=C) биде задоволена,
и потоа на стандарден излез ќе ја отпечати равенката A#B=C (нормално, на местото на # треба да стои
бараниот оператор).
Влез
Првата и единствена линија од влезот содржи три цели броја одвоени со празно место:
А, B и C, 1 <= A, B, C <= 1000 и B <= A.
Тест случаите ќе бидат направени така што секогаш ќе има точно едно решение.
Во сите тест случаи B ќе биде делител на A (A/B ќе биде цел број).
Излез
Првата и единствена линија од излезот треба да ја содржи комплетната равенка.
Внимавајте да нема празно место или знак за нов ред помеѓу A, операторот, B, = (еднаквото) и C.
 */
#include <iostream>
using namespace std;

int main() {
    int a, b, c;
    cin >> a >> b >> c;

    if (a + b == c) {
        cout << a << "+" << b << "=" << c << endl;
    } else if (a * b == c) {
        cout << a << "*" << b << "=" << c << endl;
    } else if (a - b == c) {
        cout << a << "-" << b << "=" << c << endl;
    } else if (a / b == c) {
        cout << a << "/" << b << "=" << c << endl;
    }
    return 0;
}
