//
// Created by Donik Goxha on 30-Oct-24.
//
/*
За внесени три цели броеви a, b и c да се провери дали истите може да бидат страни на триаголник.
Влез
Во првиот ред се наоѓаат броевите a, b и c (1 <= a, b, c <= 30). Броевите се одделени со еден знак
за празно место.
Излез
Излезот се состои од еден ред во кој треба да отпечатите "DA" (со големи букви, без наводниците)
доколку броевите може да бидат страни на триаголник, или "NE" доколку броевите не може да бидат страни
на триаголник.
 */
#include <iostream>
using namespace std;

int main() {
    int a,b,c;
    cin>>a>>b>>c;

    if(a+b>c && a+c>b && b+c>a) {
        cout << "DA" << endl;
    } else {
        cout << "NE" << endl;
    }
    return 0;
}
